# Dotfiles / machine bootstrap
brew "chezmoi"

# Shell / terminal UX
brew "fish"
brew "starship"
brew "bat"
brew "btop"
brew "yazi"
brew "dashlane/tap/dashlane-cli"

# Terminal app
cask "ghostty"

# Git / code workflow
brew "lazygit"
brew "glab"

# AI
cask "claude-code"
brew "opencode"
brew "rtk"
brew "ollama"

# Browser
cask "brave-browser"

# Code 
brew "pnpm" 
brew "pipx"
brew "rust"

# Build / native tooling
brew "cmake"

# Containers
brew "docker"
brew "docker-compose"

# Kubernetes / cloud
brew "stern"

# VPN
brew "openvpn"

# Data / media
brew "ffmpeg"
brew "visidata"

# Network / download
brew "wget"

# RadioFrance
cask "slack"
brew "kubectl"
brew "teleport"
